Catalogs/Назначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Назначения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательКодМДМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрузополучательКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСоглашения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузкиЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Назначения/Ext/ManagerModule.bsl
Функция СоздатьПолучитьНазначениеИзСтруктуры(СтруктураНазначения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(СтруктураНазначения.ДатаЗаказа) = Тип("Строка") Тогда
		СтруктураНазначения.ДатаЗаказа = ARMStoreKeeper.ПреобразоватьДату(СтруктураНазначения.ДатаЗаказа);		
	КонецЕсли;
	
	Если СтруктураНазначения.Свойство("ДатаОтгрузкиЗаказа") И ТипЗнч(СтруктураНазначения.ДатаОтгрузкиЗаказа) = Тип("Строка") Тогда
		СтруктураНазначения.ДатаОтгрузкиЗаказа = ARMStoreKeeper.ПреобразоватьДату(СтруктураНазначения.ДатаОтгрузкиЗаказа);		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Назначения.Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.НомерЗаказа = &НомерЗаказа
	|	И Назначения.ДатаЗаказа = &ДатаЗаказа";
	
	Запрос.УстановитьПараметр("НомерЗаказа", СтруктураНазначения.НомерЗаказа);
	Запрос.УстановитьПараметр("ДатаЗаказа", СтруктураНазначения.ДатаЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Выборка.Ссылка;	
	КонецЕсли;  
	
	НовыйЭлемент = Справочники.Назначения.СоздатьЭлемент();
	НовыйЭлемент.НомерЗаказа = СтруктураНазначения.НомерЗаказа;
	НовыйЭлемент.ДатаЗаказа = СтруктураНазначения.ДатаЗаказа;
	НовыйЭлемент.Маршрут = СтруктураНазначения.Маршрут;
	НовыйЭлемент.Грузополучатель = СтруктураНазначения.Грузополучатель;
	НовыйЭлемент.ГрузополучательКодМДМ = СтруктураНазначения.ГрузополучательКодМДМ;
	НовыйЭлемент.ГрузополучательКод = СтруктураНазначения.ГрузополучательКод;         
	НовыйЭлемент.БазаОтправитель = СтруктураНазначения.БазаОтправитель;
	НовыйЭлемент.Наименование = СтруктураНазначения.БазаОтправитель + "/" + СтруктураНазначения.НомерЗаказа + "/" + Формат(СтруктураНазначения.ДатаЗаказа, "ДЛФ=D");
	НовыйЭлемент.КодСоглашения = СтруктураНазначения.КодСоглашения;     

	Если СтруктураНазначения.Свойство("ДатаОтгрузкиЗаказа") Тогда
		НовыйЭлемент.ДатаОтгрузкиЗаказа = СтруктураНазначения.ДатаОтгрузкиЗаказа;
	КонецЕсли;

	НовыйЭлемент.Записать();   
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НовыйЭлемент.Ссылка;

КонецФункции
